<template>
    <div>
       <Head />
       <Python />
       <Articles :data="articles" />
       <Footer />
    </div>
 </template>
 
 <script>
 import Head from './components/Head.vue';
 import Python from './components/Python.vue';
 import Articles from './components/Articles.vue';
 import Footer from './components/Footer.vue';
 
 export default {
     components:{ Head, Python, Articles, Footer },
     data() {
         return {
             articles: [
                 {'id':0,
                 'foto':' https://itproger.com/img/news/x1719467835.jpg.pagespeed.ic.QKA-HKhe-1.webp',
                 'title': ' Легальний заробіток на хакерстві: баг-баунті програми та кібербезпека',
                 'intro': ' У світі IT безпека інформації критична. Баг-баунті хакери, спеціалісти з кібербезпеки, заробляють на виявленні вразливостей у системах компаній, допомагаючи захистити дані та інфраструктуру',
                 'desc': ' Баг-баунті програми (від англ. bug bounty, нагорода за помилку) — це ініціативи компаній, спрямовані на виявлення та виправлення вразливостей у їхньому програмному забезпеченні, веб-сайтах та інших цифрових продуктах. Компанії пропонують винагороду незалежним дослідникам безпеки та хакерам за виявлення багів і вразливостей. '},
 
                 {'id':1,
                 'foto':' https://itproger.com/img/news/x1718979730.jpg.pagespeed.ic.D-JkuCGZDv.webp',
                 'title': ' База даних PostgreSQL: інформація та короткий гайд',
                 'intro': ' Одна з найпопулярніших СУБД — PostgreSQL. Чому вона настільки затребувана, які в неї можливості та на що вона здатна? У цій статті ми детально розглянемо ці питання.',
                 'desc': ' PostgreSQL (або просто Postgres) — це обєктно-реляційна система управління базами даних (СУБД), відома своєю надійністю, потужністю та гнучкістю. Вона була вперше випущена у 1996 році і з тих пір активно розвивається спільнотою розробників. PostgreSQL є відкритим програмним забезпеченням, що означає, що її можна використовувати, змінювати та розповсюджувати безкоштовно.'},
 
                 {'id':2,
                 'foto':' https://itproger.com/img/news/x1717841694.jpg.pagespeed.ic.dYde5JvWCu.webp',
                 'title': ' А це що? ТОП нових мов, про які ви не чули!',
                 'intro': ' У світі ІТ постійно зявляються нові мови. Розглянемо пять таких мов: Zig, Nim, Crystal, Red та Elixir. Обговоримо їх особливості, приклади найпростіших програм і розберемо, чи варто їх вивчати.',
                 'desc': ' Zig — це мова програмування, орієнтована на розробку системного програмного забезпечення. Вона створена для вирішення проблем, повязаних з безпекою та продуктивністю, які часто зустрічаються при використанні мов низького рівня, таких як C і C++.'},
 
                 {'id':3,
                 'foto':' https://itproger.com/img/news/x1716100562.jpg.pagespeed.ic.AgprM1TaKF.webp',
                 'title': 'Роль та майбутнє WebAssembly у веб-розробці',
                 'intro': 'WebAssembly (Wasm) є революційною технологією, яка значно розширює можливості веб-розробки. Давайте познайомимося з технологією і зясуємо, на що вона здатна.',
                 'desc': ' WebAssembly – це бінарний формат для коду, який призначений для виконання у веб-браузері. Він дозволяє компілювати код, написаний на мовах програмування, таких як C, C++, Rust та інших, у формат, який може бути ефективно виконаний браузером. WebAssembly працює на рівні низькорівневого коду, забезпечуючи високу продуктивність і близькість до апаратних ресурсів.'},
 
                 {'id':4,
                 'foto':'https://itproger.com/img/news/x1721979829.jpg.pagespeed.ic.C9af4W-1mS.webp',
                 'title': ' Введення в мікросервіси за допомогою Spring Boot та Docker',
                 'intro': ' Мікросервісна архітектура стала дуже популярною серед розробників програмного забезпечення завдяки своїм перевагам, таким як масштабованість, гнучкість та незалежність компонентів.',
                 'desc': 'Мікросервіси - це архітектурний стиль, що структурує додаток як набір невеликих, незалежних сервісів, які взаємодіють один з одним через чітко визначені API. Кожен мікросервіс відповідає за виконання конкретної бізнес-логіки та може бути розроблений, розгорнутий та масштабований незалежно від інших сервісів. '},
 
                 {'id':5,
                 'foto':'https://itproger.com/img/news/x1721461000.jpg.pagespeed.ic.y9qOp0gL1e.webp',
                 'title': 'C++ у високопродуктивному та системному програмуванні',
                 'intro': 'C++ залишається однією з найбільш затребуваних та потужних програмних мов, особливо в галузях, що потребують високої продуктивності та прямого доступу до апаратних ресурсів.',
                 'desc': 'Ця мова програмування була розроблена Бярне Страуструпом на початку 1980-х років як розширення мови C. З тих пір вона набула широкого поширення і стала невідємною частиною багатьох великих проектів у різних індустріях, включаючи розробку ігор, системи реального часу та фінансові додатки. '},
 
                 {'id':6,
                 'foto': 'https://itproger.com/img/news/x1720865922.jpg.pagespeed.ic.YVjliwo2FJ.webp',
                 'title': '5 найкращих опенсорсних інструментів для компютерного зору',
                 'intro': 'Ми розглянемо 5 ключових опенсорсних бібліотек, які надають широкий спектр можливостей для вирішення завдань у галузі компютерного зору та виявлення аномалій у зображеннях.',
                 'desc': ' Kangas значно розширює функціональність бібліотеки Pandas, пропонуючи інструменти для роботи з мультимедійними даними. За допомогою Kangas можна створювати DataGrids, аналогічні DataFrame в Pandas, що дозволяє ефективно журналювати набори даних і відлагоджувати прогнози моделі на рівні окремих зразків. Ця бібліотека робить процес аналізу даних більш простим і інтуїтивно зрозумілим.'},
 
                 {'id':7,
                 'foto': 'https://itproger.com/img/news/x1720263423.jpg.pagespeed.ic.6o7r-R6rXr.webp',
                 'title': 'SEO-фахівці: Хто вони, чим займаються і чому їхня робота важлива',
                 'intro': 'SEO-фахівці відіграють ключову роль у просуванні сайтів у пошукових системах. У статті розповімо, хто вони такі, чим займаються, які у них зарплати у 2024 році та яке майбутнє цієї професії.',
                 'desc': ' SEO (Search Engine Optimization) або оптимізація для пошукових систем — це процес покращення видимості веб-сайту в результатах пошуку, таких як Google. SEO-спеціалісти — це професіонали, які займаються оптимізацією сайтів, щоб ті займали вищі позиції в пошукових системах. Їхня робота включає в себе широкий спектр завдань: від аналізу ключових слів до створення якісного контенту і роботи з зовнішніми посиланнями.'}
                 
             ]
         }
     }
 }
 </script>
 
 <style lang="scss">
    
 </style>